---
layout: post
title: Redis 常用命令
tag: Redis
---

## 参考
[https://blog.csdn.net/xusir_1/article/details/80272819](https://blog.csdn.net/xusir_1/article/details/80272819)
[https://redis.io/commands](https://redis.io/commands)

## 基本类型
redis 中的`table`是以`key`的形式存在的，`key`可以分为五种类型

1. **string**: 字符串
2. **hash**: 哈希
3. **list**: 列表
4. **set**: 集合
5. **zset**: 有序集合(sorted set)

后面又增加了
* **bit arrays** (或者说 simply bitmaps)
* 在 2.8.9 版本又添加了**Hyper

## 数据库
默认情况下 redis 提供了 16 个 db，即`db0 - db15`
```shell
# 修改数据库个数
$ vim redis.conf
databases 16

# 修改密码
$ vim redis.conf
requirepass 123456
```

### 连接 redis command line 
```shell
# 默认连接 db0
# -h: ip/host
# -p: port
# -a: password
redis-cli -h rus-service -p 6379 -a 123456
# 检验是否成功连接
rus-service:6379>ping
PONG
```

### 切换数据库
```shell
# 语法 
select index (0~15)
# 切换到 db1
rus-service:6379> select 1
rus-service:6379[1]>
```


### 清空数据(线上环境别用！)
```shell
# 删除当前数据库的所有 keys
rus-service:6379> flushdb

# 删除所有数据库的所有 keys
rus-service:6379> flushall
```

## redis config
```shell
# 获取所有配置
rus-service:6379> config get *

# 获取指定配置，如：查看安装路径
rus-service:6379> config get dir 

# 修改指定配置
config set [key] [value]
# 例如：修改日志等级
rus-service:6379> config set logleve "notice"
```

## key 操作
### 查看
```shell
# key 是否存在，返回 integer，即返回存在的数量
exists key [key2...]

# 查看给定模式的 key(非正则)
keys [pattern]
# 例如：查看所有的 key
rus-service:6379> keys *

# 随机返回一个 db 中存在的 key
randomkey

# 删除 key,返回 integer，即返回删除成功的数量
del key [key1...] 
```

### 设置 key 过期时间
```shell

```

